# -*- coding: utf-8 -*-
# @Time    : 2019/7/27 22:54
# @Author  : DrMa
'''

题目:输入一个整数,输出它的二进制数中1的个数.

思路:
1. 很tricky, 假设输入为n, 假设对应的二进制是1100:
n:         1100
n-1:       1011
n=n&(n-1): 1000  #减少了一个1
n:         1000
n-1:       0111
n=n&(n-1): 0000  #又减少了一个1

2. 负数的二进制表示: 1.得到原码 2.逐位求反得到反码 3. 加1得到补码即结果.
例: -2的二进制表示:
    1.原码 10, 补位(8或者16都行),0000 0010.
    2.反码 1111 1101
    3.补码 1111 1110
3.在python中求a的补码就简单了: a=a & 0xffff (8位补码) a=a& 0xffffffff (16位补码)
'''
def num_binary_1(n):
    count=0
    if n < 0:#如果是负数,我们要得到补码,因为负数的二进制用补码表示
        n = n & 0xffffffff
    while n>0:
        n= n &(n-1) #核心,&默认是二进制进行运算
        count+=1
    return count
